Repository: asujinaohyes-sudo/app1
Catalog: car_booking_app/lib/l10n/app_*.arb
Languages: th

source: Login
th: เข้าสู่ระบบ

source: Sign in with Google
th: ลงชื่อเข้าใช้ด้วย Google

source: Car Booking Calendar
th: ปฏิทินการจองรถ

# bookACarOn
source: Book a Car on {date}
th: จองรถสำหรับวันที่ {date}

source: Your Name
th: ชื่อของคุณ

source: Please enter your name
th: กรุณากรอกชื่อของคุณ

source: Select Car Type
th: เลือกประเภทรถ

source: Please select a car type
th: กรุณาเลือกประเภทรถ

# pickupTime
source: Pickup Time: {time}
th: เวลารับรถ: {time}

# returnTime
source: Return Time: {time}
th: เวลาคืนรถ: {time}

source: Not set
th: ยังไม่ได้ตั้งค่า

source: Additional Notes
th: หมายเหตุเพิ่มเติม

source: Submit Booking
th: ยืนยันการจอง

source: Please select pickup and return times.
th: กรุณาเลือกเวลารับและคืนรถ

source: Booking successfully created!
th: สร้างการจองสำเร็จ!

# failedToCreateBooking
source: Failed to create booking: {error}
th: ไม่สามารถสร้างการจองได้: {error}
